import { Text , ScrollView , Image , View } from "react-native";
import {TailwindProvider} from 'tailwindcss-react-native'
import React from "react";

export default function Demo1 (){
    return (
        <TailwindProvider>
            <ScrollView> 
                <View className="px-2 pt-5">
                    <Text className="text-center pt-5 text-3xl text-gray-500">
                        30 ที่เที่ยวนครนายก 2023 เที่ยวนครนายก กับที่เด็ดๆ [มีนาคม 2023]
                    </Text>
                    <View className="mt-5 mb-5 flex justify-center items-center">
                        <Image source={require('../../assets/overview.jpg')} className= "w-[400px] h-[400px]"/>
                    </View>
                    <Text>
                        ยินดีต้อนรับแฟนเพจทุกๆ ท่านค่า กลับมาพบกันอีกครั้งนะคะ ซึ่งแน่นอนในวันนี้แอดจะพาทุกคนไปท่องเที่ยวกันค่า วันนี้ขอเสนอ ที่เที่ยวนครนายก เป็นอีกหนึ่งจังหวัดในภาคตะวันออกที่มีที่เที่ยวปากช่องเป็น สถานที่ท่องเที่ยวนครนายก สวยมากกกกใกล้วัดมณีวงศ์สำหรับใครที่กำลังมองหาวัดสวยนครนายกและวัดมณีวงศ์สถานที่ท่องเที่ยวที่ดื่มด่ำกับธรรมชาติแบบชิลๆ แนะนำมา เที่ยวนครนายก ค่ะ เกริ่นมาขนาดนี้แล้วทุกคนอยากจะรู้จัก นครนายกที่เที่ยว กันแล้วใช่ไหมคะ งั้นเราไปกันเลยค่า
                    </Text>

                    <Text className="mt-10 font-bold">
                       น้ำตกนางรอง
                    </Text>
                    <View className="mt-5 mb-5 flex justify-center items-center">
                        <Image source={require('../../assets/nagerong.jpeg')} className= "w-[400px] h-[400px]"/>
                    </View>
                    <Text>
                    น้ำตกนางรอง น้ำตกนครนายก ตั้งอยู่ที่ตำบลหินตั้ง อำเภอเมือง จังหวัดนครนายก ห่างจากตัวเมืองประมาณ 20 กิโลเมตร ตามทางหลวงหมายเลข 3049 อยู่ในเขตอุทยานแห่งชาติเขาใหญ่ เป็นน้ำตกขนาดกลางที่ไหลลดหลั่นลงมาเป็นชั้นๆ มีความสวยงามเป็นธรรมชาติ การจัดบริเวณภายในเป็นระเบียบ สะอาดตา มีห้องอาบน้ำและห้องสุขาให้บริการ พร้อมบ้านพักให้บริการสำหรับผู้ที่จะพักค้างคืน
                    </Text>

                    <Text className="mt-10 font-bold">
                        เขื่อนขุนด่านปราการชล
                    </Text>
                    <View className="mt-5 mb-5 flex justify-center items-center">
                        <Image source={require('../../assets/kun.jpeg')} className= "w-[400px] h-[400px]"/>
                    </View>
                    <Text>
                    อีกหนึ่งแลนด์มาร์คที่ต้องมาเยือนเมื่อเที่ยวนครนายก ไม่มีทางไปไม่ถึงเพราะถนนทั่วทั้งจังหวัดล้วนมีป้ายชี้มาที่นี่ทั้งนั้น! เอาเป็นว่าจังหวัดเขาอยากให้มาเยือนมากก็ต้องมาสักหน่อยเพื่อพิสูจน์ว่าเด็ดจริงหรือเปล่า เพราะเขาเขียนไว้ตัวเบ้อเร่อเชียวนะว่าเป็นเขื่อนคอนกรีตอัดบดยาวที่สุดในโลก มีความยาวรวม 2,720 เมตร ความความสูงจุดสูงสุด 93 เมตร ความจุน้ำมากถึง 224 ล้านลูกบาศก์เมตร สามารถลงเล่นน้ำด้านล่างของเขื่อน โดยนอกจากจะทำการระบายน้ำตามฤดูกาล ในวันหยุดเสาร์-อาทิตย์ หรือเทศกาลต่างๆ จะมีการผันน้ำเพื่อให้ประชาชนได้เล่นกันอย่างสนุกสนานด้วย
                    </Text>
                </View>
                
                
            </ScrollView>
        </TailwindProvider>
       
    )
}

